RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal_rcc_ex.c
#if defined(RCC_CR_PLL3ON)
  /* Get the PLL3 Clock configuration -----------------------------------------------*/
  pPeriphClkInit->PLL3.PLL3Source = (uint32_t)((RCC->PLL3CFGR & RCC_PLL3CFGR_PLL3SRC) >> RCC_PLL3CFGR_PLL3SRC_Pos);
  pPeriphClkInit->PLL3.PLL3M = (uint32_t)((RCC->PLL3CFGR & RCC_PLL3CFGR_PLL3M) >> RCC_PLL3CFGR_PLL3M_Pos);
  pPeriphClkInit->PLL3.PLL3N = (uint32_t)((RCC->PLL3DIVR & RCC_PLL3DIVR_PLL3N) >> RCC_PLL3DIVR_PLL3N_Pos) + 1U;
  pPeriphClkInit->PLL3.PLL3P = (uint32_t)((RCC->PLL3DIVR & RCC_PLL3DIVR_PLL3P) >> RCC_PLL3DIVR_PLL3P_Pos) + 1U;
  pPeriphClkInit->PLL3.PLL3Q = (uint32_t)((RCC->PLL3DIVR & RCC_PLL3DIVR_PLL3Q) >> RCC_PLL3DIVR_PLL3Q_Pos) + 1U;
  pPeriphClkInit->PLL3.PLL3R = (uint32_t)((RCC->PLL3DIVR & RCC_PLL3DIVR_PLL3R) >> RCC_PLL3DIVR_PLL3R_Pos) + 1U;
  pPeriphClkInit->PLL3.PLL3RGE = (uint32_t)((RCC->PLL3CFGR & RCC_PLL3CFGR_PLL3RGE) >> RCC_PLL3CFGR_PLL3RGE_Pos);
  pPeriphClkInit->PLL3.PLL3FRACN = (uint32_t)((RCC->PLL3FRACR & RCC_PLL3FRACR_PLL3FRACN) >> \
                                              RCC_PLL3FRACR_PLL3FRACN_Pos);
#endif /* RCC_CR_PLL3ON */

  /* Get the USART1 clock source ---------------------------------------------*/
  pPeriphClkInit->Usart1ClockSelection = __HAL_RCC_GET_USART1_SOURCE();

  /* Get the USART2 clock source ---------------------------------------------*/
  pPeriphClkInit->Usart2ClockSelection = __HAL_RCC_GET_USART2_SOURCE();

  /* Get the USART3 clock source ---------------------------------------------*/
  pPeriphClkInit->Usart3ClockSelection = __HAL_RCC_GET_USART3_SOURCE();

#if defined(UART4)
  /* Get the UART4 clock source ----------------------------------------------*/
  pPeriphClkInit->Uart4ClockSelection = __HAL_RCC_GET_UART4_SOURCE();
#endif /* UART4 */

#if defined(UART5)
  /* Get the UART5 clock source ----------------------------------------------*/
  pPeriphClkInit->Uart5ClockSelection = __HAL_RCC_GET_UART5_SOURCE();
#endif /* UART5 */

#if defined(USART6)
  /* Get the USART6 clock source ---------------------------------------------*/
  pPeriphClkInit->Usart6ClockSelection = __HAL_RCC_GET_USART6_SOURCE();
#endif /* USART6 */

#if defined(UART7)
  /* Get the UART7 clock source ---------------------------------------------*/
  pPeriphClkInit->Uart7ClockSelection = __HAL_RCC_GET_UART7_SOURCE();
#endif /* UART7 */

#if defined(UART8)
  /* Get the UART8 clock source ---------------------------------------------*/
  pPeriphClkInit->Uart8ClockSelection = __HAL_RCC_GET_UART8_SOURCE();
#endif /* UART8 */

#if defined(UART9)
  /* Get the UART9 clock source ---------------------------------------------*/
  pPeriphClkInit->Uart9ClockSelection = __HAL_RCC_GET_UART9_SOURCE();
#endif /* UART9 */

#if defined(USART10)
  /* Get the USART10 clock source ---------------------------------------------*/
  pPeriphClkInit->Usart10ClockSelection = __HAL_RCC_GET_USART10_SOURCE();
#endif /* USART10 */

#if defined(USART11)
  /* Get the USART11 clock source ---------------------------------------------*/
  pPeriphClkInit->Usart11ClockSelection = __HAL_RCC_GET_USART11_SOURCE();
#endif /* USART11 */

#if defined(UART12)
  /* Get the UART12 clock source ---------------------------------------------*/
  pPeriphClkInit->Uart12ClockSelection = __HAL_RCC_GET_UART12_SOURCE();
#endif /* UART12 */

  /* Get the LPUART1 clock source --------------------------------------------*/
  pPeriphClkInit->Lpuart1ClockSelection = __HAL_RCC_GET_LPUART1_SOURCE();

  /* Get the I2C1 clock source -----------------------------------------------*/
  pPeriphClkInit->I2c1ClockSelection = __HAL_RCC_GET_I2C1_SOURCE();

  /* Get the I2C2 clock source -----------------------------------------------*/
  pPeriphClkInit->I2c2ClockSelection = __HAL_RCC_GET_I2C2_SOURCE();

#if defined(I2C3)
  /* Get the I2C3 clock source -----------------------------------------------*/
  pPeriphClkInit->I2c3ClockSelection = __HAL_RCC_GET_I2C3_SOURCE();
#endif /* I2C3 */

#if defined(I2C4)
  /* Get the I2C4 clock source -----------------------------------------------*/
  pPeriphClkInit->I2c4ClockSelection = __HAL_RCC_GET_I2C4_SOURCE();
#endif /* I2C4 */

  /* Get the I3C1 clock source -----------------------------------------------*/
  pPeriphClkInit->I3c1ClockSelection = __HAL_RCC_GET_I3C1_SOURCE();

#if defined(I3C2)
  /* Get the I3C2 clock source -----------------------------------------------*/
  pPeriphClkInit->I3c2ClockSelection = __HAL_RCC_GET_I3C2_SOURCE();
#endif /* I3C2 */

  /* Get the LPTIM1 clock source ---------------------------------------------*/
  pPeriphClkInit->Lptim1ClockSelection = __HAL_RCC_GET_LPTIM1_SOURCE();

  /* Get the LPTIM2 clock source ---------------------------------------------*/
  pPeriphClkInit->Lptim2ClockSelection = __HAL_RCC_GET_LPTIM2_SOURCE();

#if defined(LPTIM3)
  /* Get the LPTIM3 clock source ---------------------------------------------*/
  pPeriphClkInit->Lptim3ClockSelection = __HAL_RCC_GET_LPTIM3_SOURCE();
#endif /* LPTIM3 */

#if defined(LPTIM4)
  /* Get the LPTIM4 clock source ---------------------------------------------*/
  pPeriphClkInit->Lptim4ClockSelection = __HAL_RCC_GET_LPTIM4_SOURCE();
#endif /* LPTIM4 */

#if defined(LPTIM5)
  /* Get the LPTIM5 clock source ---------------------------------------------*/
  pPeriphClkInit->Lptim5ClockSelection = __HAL_RCC_GET_LPTIM5_SOURCE();
#endif /* LPTIM5 */

#if defined(LPTIM6)
  /* Get the LPTIM6 clock source ---------------------------------------------*/
  pPeriphClkInit->Lptim6ClockSelection = __HAL_RCC_GET_LPTIM6_SOURCE();
#endif /* LPTIM6 */

  /* Get the FDCAN clock source ---------------------------------------------*/
  pPeriphClkInit->FdcanClockSelection = __HAL_RCC_GET_FDCAN_SOURCE();

#if defined(SAI1)
  /* Get the SAI1 clock source -----------------------------------------------*/
  pPeriphClkInit->Sai1ClockSelection = __HAL_RCC_GET_SAI1_SOURCE();
#endif /* SAI1 */

#if defined(SAI2)
  /* Get the SAI2 clock source -----------------------------------------------*/
  pPeriphClkInit->Sai2ClockSelection = __HAL_RCC_GET_SAI2_SOURCE();
#endif /* SAI2 */

