RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal_rcc_ex.c
  return (frequency);
}

/**
  * @}
  */

/** @defgroup RCCEx_Exported_Functions_Group2 Extended Clock management functions
  *  @brief  Extended Clock management functions
  *
@verbatim
 ===============================================================================
                ##### Extended clock management functions  #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the
    activation or deactivation of PLL2, PLL3, LSE CSS,
    Low speed clock output and clock after wake-up from STOP mode.
@endverbatim
  * @{
  */

/**
  * @brief  Initialize and Enable the PLL2  according to the specified
  *         parameters in the RCC_PLL2InitTypeDef.
  * @param  pPLL2Init  pointer to an RCC_PLL2InitTypeDef structure that
  *         contains the configuration information for the PLL2
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCCEx_EnablePLL2(RCC_PLL2InitTypeDef  *pPLL2Init)
{
  uint32_t tickstart;
  HAL_StatusTypeDef status = HAL_OK;

  /* check for PLL2 Parameters used to output PLL2CLK */
  assert_param(IS_RCC_PLL2_SOURCE(pPLL2Init->PLL2Source));
  assert_param(IS_RCC_PLL2_DIVM_VALUE(pPLL2Init->PLL2M));
  assert_param(IS_RCC_PLL2_MULN_VALUE(pPLL2Init->PLL2N));
  assert_param(IS_RCC_PLL2_DIVP_VALUE(pPLL2Init->PLL2P));
  assert_param(IS_RCC_PLL2_DIVQ_VALUE(pPLL2Init->PLL2Q));
  assert_param(IS_RCC_PLL2_DIVR_VALUE(pPLL2Init->PLL2R));
  assert_param(IS_RCC_PLL2_CLOCKOUT_VALUE(pPLL2Init->PLL2ClockOut));
  assert_param(IS_RCC_PLL2_VCIRGE_VALUE(pPLL2Init->PLL2RGE));
  assert_param(IS_RCC_PLL2_VCORGE_VALUE(pPLL2Init->PLL2VCOSEL));
  assert_param(IS_RCC_PLL2_FRACN_VALUE(pPLL2Init->PLL2FRACN));

  /* Disable the PLL2 */
  __HAL_RCC_PLL2_DISABLE();

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Wait till PLL2 is ready to be updated */
  while (READ_BIT(RCC->CR, RCC_CR_PLL2RDY) != 0U)
  {
    if ((HAL_GetTick() - tickstart) > PLL2_TIMEOUT_VALUE)
    {
      status = HAL_TIMEOUT;
      break;
    }
  }

  if (status == HAL_OK)
  {
    /* Make sure PLL2Source is ready */
    status = RCCEx_PLLSource_Enable(pPLL2Init->PLL2Source);

    if (status == HAL_OK)
    {
      /* Configure the PLL2 clock source, multiplication factor N, */
      /* and division factors M, P, Q and R */
      __HAL_RCC_PLL2_CONFIG(pPLL2Init->PLL2Source, pPLL2Init->PLL2M, pPLL2Init->PLL2N,
                            pPLL2Init->PLL2P, pPLL2Init->PLL2Q, pPLL2Init->PLL2R);

      /* Disable PLL2FRACN . */
      __HAL_RCC_PLL2_FRACN_DISABLE();

      /* Configure PLL2 FRACN */
      __HAL_RCC_PLL2_FRACN_CONFIG(pPLL2Init->PLL2FRACN);

      /* Enable PLL2FRACN */
      __HAL_RCC_PLL2_FRACN_ENABLE();

      /* Select PLL2 input reference frequency range: VCI */
      __HAL_RCC_PLL2_VCIRANGE(pPLL2Init->PLL2RGE);

      /* Select PLL2 output frequency range : VCO */
      __HAL_RCC_PLL2_VCORANGE(pPLL2Init->PLL2VCOSEL);

      /* Configure the PLL2 Clock output(s) */
      __HAL_RCC_PLL2_CLKOUT_ENABLE(pPLL2Init->PLL2ClockOut);

      /* Enable the PLL2 again by setting PLL2ON to 1*/
      __HAL_RCC_PLL2_ENABLE();

      /* Get Start Tick*/
      tickstart = HAL_GetTick();

      /* Wait till PLL2 is ready */
      while (READ_BIT(RCC->CR, RCC_CR_PLL2RDY) == 0U)
      {
        if ((HAL_GetTick() - tickstart) > PLL2_TIMEOUT_VALUE)
        {
          status = HAL_TIMEOUT;
          break;
        }
      }
    }
  }

  return status;
}

/**
  * @brief  Disable PLL2.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCCEx_DisablePLL2(void)
{
  uint32_t tickstart;
  HAL_StatusTypeDef status = HAL_OK;

  /* Disable the PLL2 */
  __HAL_RCC_PLL2_DISABLE();

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Wait till PLL2 is disabled */
  while (READ_BIT(RCC->CR, RCC_CR_PLL2RDY) != 0U)
  {
    if ((HAL_GetTick() - tickstart) > PLL2_TIMEOUT_VALUE)
    {
      status = HAL_TIMEOUT;
      break;
    }
  }

  /* To save power, disable the PLL2 Source, FRACN and Clock outputs */
  CLEAR_BIT(RCC->PLL2CFGR, RCC_PLL2CFGR_PLL2PEN | RCC_PLL2CFGR_PLL2QEN | RCC_PLL2CFGR_PLL2REN | RCC_PLL2CFGR_PLL2SRC |
            RCC_PLL2CFGR_PLL2FRACEN);

  return status;
}

#if defined(RCC_CR_PLL3ON)
/**
  * @brief  Initialize and Enable the PLL3  according to the specified
  *         parameters in the RCC_PLL3InitTypeDef.
  * @param  pPLL3Init  pointer to an RCC_PLL3InitTypeDef structure that
  *         contains the configuration information for the PLL3
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RCCEx_EnablePLL3(RCC_PLL3InitTypeDef  *pPLL3Init)
{
  uint32_t tickstart;
  HAL_StatusTypeDef status = HAL_OK;

  /* check for PLL3 Parameters used to output PLL3CLK */
  assert_param(IS_RCC_PLL3_SOURCE(pPLL3Init->PLL3Source));
  assert_param(IS_RCC_PLL3_DIVM_VALUE(pPLL3Init->PLL3M));
  assert_param(IS_RCC_PLL3_MULN_VALUE(pPLL3Init->PLL3N));
  assert_param(IS_RCC_PLL3_DIVP_VALUE(pPLL3Init->PLL3P));
  assert_param(IS_RCC_PLL3_DIVQ_VALUE(pPLL3Init->PLL3Q));
  assert_param(IS_RCC_PLL3_DIVR_VALUE(pPLL3Init->PLL3R));
  assert_param(IS_RCC_PLL3_CLOCKOUT_VALUE(pPLL3Init->PLL3ClockOut));
  assert_param(IS_RCC_PLL3_VCIRGE_VALUE(pPLL3Init->PLL3RGE));
  assert_param(IS_RCC_PLL3_VCORGE_VALUE(pPLL3Init->PLL3VCOSEL));
  assert_param(IS_RCC_PLL3_FRACN_VALUE(pPLL3Init->PLL3FRACN));

  /* Disable the PLL3 */
  __HAL_RCC_PLL3_DISABLE();

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Wait till PLL3 is ready to be updated */
  while (READ_BIT(RCC->CR, RCC_CR_PLL3RDY) != 0U)
  {
    if ((HAL_GetTick() - tickstart) > PLL3_TIMEOUT_VALUE)
    {
      status = HAL_TIMEOUT;
      break;
    }
  }

  if (status == HAL_OK)
  {
    /* Make sure PLL3Source is ready */
    status = RCCEx_PLLSource_Enable(pPLL3Init->PLL3Source);

    if (status == HAL_OK)
    {
      /* Configure the PLL3 clock source, multiplication factor N, */
      /* and division factors M and P */
      __HAL_RCC_PLL3_CONFIG(pPLL3Init->PLL3Source, pPLL3Init->PLL3M, pPLL3Init->PLL3N,  pPLL3Init->PLL3P,
                            pPLL3Init->PLL3Q, pPLL3Init->PLL3R);

      /* Disable PLL3FRACN . */
      __HAL_RCC_PLL3_FRACN_DISABLE();

      /* Configure PLL3 FRACN */
      __HAL_RCC_PLL3_FRACN_CONFIG(pPLL3Init->PLL3FRACN);

      /* Enable PLL3FRACN . */
      __HAL_RCC_PLL3_FRACN_ENABLE();

